feat: more wake word support
